# More SQL with SQLite in Python

**Note:** Ensure the `sakila.db` file is in your working directory before running the notebook.

In [1]:
import sqlite3
import pandas as pd

# Set the path to the SQLite database
db_path = "sakila.db"

# Connect to SQLite database
conn = sqlite3.connect(db_path)
print("Connected to SQLite Sakila database!")

Connected to SQLite Sakila database!

### Exploring the Database Schema

Before diving into queries, it's useful to know which tables are available in the Sakila database. We'll list all tables by querying the SQLite master table.

In [2]:
# List all tables in the database
tables = pd.read_sql("""SELECT name 
                        FROM sqlite_master 
                        WHERE type='table';""", conn)

print("Tables in the database:")
print(tables)

Tables in the database:
               name
0             actor
1           country
2              city
3           address
4          language
5          category
6          customer
7              film
8        film_actor
9     film_category
10        film_text
11        inventory
12            staff
13            store
14          payment
15           rental
16        customers
17  sqlite_sequence
18       test_table

## Part 1. Other Operations
These operations help you filter numeric data and handle potential NULLs. We’ll use the film table as an example:

### BETWEEN Operator
Select films where the film length is within a specified range.

In [6]:
# Define SQL query to fetch the first 5 rows from the actor table.
query_between = """
                SELECT title, length
                FROM film
                WHERE length BETWEEN 80 AND 120
                ORDER BY length DESC

                """

# Execute the query using pd.read_sql.
df_between = pd.read_sql(query_between, conn)

print("Select films between 80 and 120 minutes:")
print(df_between)

Select films between 80 and 120 minutes:
                 title  length
0    CALENDAR GUNFIGHT     120
1      COMMAND DARLING     120
2           DAZED PUNK     120
3           DOLLS RAGE     120
4          KARATE MOON     120
..                 ...     ...
295   SADDLE ANTITRUST      80
296         SEA VIRGIN      80
297   SHAWSHANK BUBBLE      80
298          TURN STAR      80
299        WAR NOTTING      80

[300 rows x 2 columns]

### IS NOT NULL Operator
Ensure that you only fetch rows with actual (non-null) values.

In [10]:
# Define SQL query to fetch the first 5 rows from the actor table.
query_nonnull = """
                SELECT title, description
                FROM film
                WHERE description IS NOT NULL;
                """

# Execute the query using pd.read_sql.
df_nonnull = pd.read_sql(query_nonnull, conn)

print("Drop rows without descriptions:")
print(df_nonnull)

Drop rows without descriptions:
                 title                                        description
0     ACADEMY DINOSAUR  A Epic Drama of a Feminist And a Mad Scientist...
1       ACE GOLDFINGER  A Astounding Epistle of a Database Administrat...
2     ADAPTATION HOLES  A Astounding Reflection of a Lumberjack And a ...
3     AFFAIR PREJUDICE  A Fanciful Documentary of a Frisbee And a Lumb...
4          AFRICAN EGG  A Fast-Paced Documentary of a Pastry Chef And ...
..                 ...                                                ...
995     YOUNG LANGUAGE  A Unbelieveable Yarn of a Boat And a Database ...
996         YOUTH KICK  A Touching Drama of a Teacher And a Cat who mu...
997       ZHIVAGO CORE  A Fateful Yarn of a Composer And a Man who mus...
998  ZOOLANDER FICTION  A Fateful Reflection of a Waitress And a Boat ...
999          ZORRO ARK  A Intrepid Panorama of a Mad Scientist And a B...

[1000 rows x 2 columns]

### IN Operator
Filter rows by matching a column against a list of values.

In [13]:
# Define SQL query to fetch the first 5 rows from the actor table.
query_rating = """
                SELECT f.rating, f.title, COUNT(DISTINCT fa.actor_id) AS actor_count
                FROM film AS f
                JOIN film_actor AS fa ON f.film_id = fa.film_id
                WHERE f.rating IN ("G", "PG")
                GROUP BY f.rating, f.title
               """

# Execute the query using pd.read_sql.
df_rating = pd.read_sql(query_rating, conn)

print("Query of distint count of actors per title and G and PG rated films:")
print(df_rating)

Query of distint count of actors per title and G and PG rated films:
    rating                 title  actor_count
0        G        ACE GOLDFINGER            4
1        G      AFFAIR PREJUDICE            5
2        G           AFRICAN EGG            5
3        G       ALAMO VIDEOTAPE            4
4        G     AMISTAD MIDSUMMER            4
..     ...                   ...          ...
366     PG    WIZARD COLDBLOODED            9
367     PG             WON DARES            5
368     PG  WONDERLAND CHRISTMAS            5
369     PG          WORDS HUNTER            6
370     PG          WORST BANGER            4

[371 rows x 3 columns]

## Part 2. Text Operations
Use the LIKE operator with wildcards to match text patterns—again, using the `film` table:

Using Wildcards with LIKE:

- `%` matches zero or more characters.
- `_` matches exactly one character.

In [18]:
query_wildcard1 = """
                    SELECT title
                    FROM film
                    WHERE title LIKE 'A%' OR title LIKE '%S'
                  """

# Execute the query using pd.read_sql.
df_wc1 = pd.read_sql(query_wildcard1, conn)

print("Query films that either start with A or end with s:")
print(df_wc1)

Query films that either start with A or end with s:
                    title
0        ACADEMY DINOSAUR
1          ACE GOLDFINGER
2        ADAPTATION HOLES
3        AFFAIR PREJUDICE
4             AFRICAN EGG
..                    ...
179             WAKE JAWS
180             WON DARES
181  WONDERLAND CHRISTMAS
182   WORKING MICROCOSMOS
183    WORLD LEATHERNECKS

[184 rows x 1 columns]

In [17]:
query_wildcard2 = """
                    SELECT title
                    FROM film
                    WHERE title LIKE '_A%'
                  """

# Execute the query using pd.read_sql.
df_wc2 = pd.read_sql(query_wildcard2, conn)

print("Query films where the second letter is 'a':")
print(df_wc2)

Query films where the second letter is 'a':
                      title
0                 BABY HALL
1       BACKLASH UNDEFEATED
2               BADMAN DAWN
3           BAKED CLEOPATRA
4          BALLOON HOMEWARD
..                      ...
184           WASH HEAVENLY
185        WASTELAND DIVINE
186             WATCH TRACY
187  WATERFRONT DELIVERANCE
188      WATERSHIP FRONTIER

[189 rows x 1 columns]

# Group Exercises
- Find a neighbor, yes, move around and make a new friend!
- Work through the following practice exercises together.

# Partner Practice Exercise

Now that we've seen several examples of JOINs and aggregation queries, it's time for you to practice with a partner. Complete the following tasks using the Sakila database:

1. **Challenge 1: Short Films with Language**
   - Write a query that returns each film’s title, description, and language name (labeled as “language”) from the `film` and `language` tables, for all films with length under 100. Join `film.language_id` to `language.language_id` to retrieve the language name.

2. **Challenge 2: Specific Ratings Filter with Language**
   - Write a query to display each film’s title, rating, and language name (as “language”) for all films whose rating is either ‘PG-13’ or ‘R.’ Join film.language_id to language.language_id.

3. **Challenge 3: Pattern Matching on Film Titles with Category**
   - Write a query to list each film’s title and its category name (as “category”) for all films whose title begins with “T” or ends with “s.” Join film to film_category and then to category to retrieve the category name.

4. **Challenge 4: Single-Character Wildcard with Actor Join**
   - Write a query that lists each film’s title and the actor’s full name (using first_name || ' ' || last_name) for all films whose title has “y” as the second character. Join film, film_actor, and actor on their respective IDs.

5. **Challenge 5: Distinct Customer Payments and Rentals**
   - Write a query to display each customer’s ID along with the total number of distinct payments and rentals they have made. Use LEFT JOIN with the payment and rental tables, group by the customer, and order by total payments (descending) then total rentals (descending).

6. **Challenge 6: Advanced Filtering with Category**
   - Write a query that returns each film’s title, rental rate, length, and category (labeled as “category”) for films whose rental rate is between 2.99 and 4.99, rating is either ‘PG’ or ‘R,’ and title starts with “A.” Join film to film_category and category to retrieve the category name.
         - HINT: USE `AND` as a dependent clause of your `WHERE` clause to create multiple conditions.
         
Discuss your approaches with your partner, compare your results, and be ready to review a few solutions as a class.

In [30]:
query_chal1 = """
                SELECT f.title, f.description, l.name AS language
                FROM film AS f
                JOIN language AS l ON f.language_id = l.language_id
                WHERE f.length < 100;
              """

# Execute the query using pd.read_sql.
df_chal1 = pd.read_sql(query_chal1, conn)

print("Challenge 1")
print(df_chal1)

Challenge 1
                   title                                        description  \
0       ACADEMY DINOSAUR  A Epic Drama of a Feminist And a Mad Scientist...
1         ACE GOLDFINGER  A Astounding Epistle of a Database Administrat...
2       ADAPTATION HOLES  A Astounding Reflection of a Lumberjack And a ...
3        AIRPLANE SIERRA  A Touching Saga of a Hunter And a Butler who m...
4        AIRPORT POLLOCK  A Epic Tale of a Moose And a Girl who must Con...
..                   ...                                                ...
373        WOLVES DESIRE  A Fast-Paced Drama of a Squirrel And a Robot w...
374            WONKA SEA  A Brilliant Saga of a Boat And a Mad Scientist...
375  WORKING MICROCOSMOS  A Stunning Epistle of a Dentist And a Dog who ...
376          YENTL IDAHO  A Amazing Display of a Robot And a Astronaut w...
377            ZORRO ARK  A Intrepid Panorama of a Mad Scientist And a B...

    language
0    English
1    English
2    English
3    English
4    English
..       ...
373  English
374  English
375  English
376  English
377  English

[378 rows x 3 columns]

In [33]:
query_chal2 = """
                SELECT f.title, f.rating, l.name AS language
                FROM film AS f
                JOIN language AS l ON f.language_id = l.language_id
                WHERE f.rating IN ('R','PG-13')
              """

# Execute the query using pd.read_sql.
df_chal2 = pd.read_sql(query_chal2, conn)

print("Challenge 2")
print(df_chal2)

Challenge 2
                  title rating language
0       AIRPLANE SIERRA  PG-13  English
1       AIRPORT POLLOCK      R  English
2         ALABAMA DEVIL  PG-13  English
3            ALONE TRIP      R  English
4         ALTER VICTORY  PG-13  English
..                  ...    ...      ...
413  WORLD LEATHERNECKS  PG-13  English
414      WRONG BEHAVIOR  PG-13  English
415       WYOMING STORM  PG-13  English
416         YENTL IDAHO      R  English
417   ZOOLANDER FICTION      R  English

[418 rows x 3 columns]

In [46]:
query_chal3 = """
                SELECT f.title, c.name AS category
                FROM film AS f
                JOIN film_category AS fc ON f.film_id = fc.film_id
                JOIN category AS c ON fc.category_id = c.category_id
                WHERE f.title LIKE 'T%' OR title LIKE '%S' 
              """

# Execute the query using pd.read_sql.
df_chal3 = pd.read_sql(query_chal3, conn)

print("Challenge 3")
print(df_chal3)

Challenge 3
                    title     category
0        ADAPTATION HOLES  Documentary
1     AMELIE HELLFIGHTERS        Music
2         AMERICAN CIRCUS       Action
3    ANACONDA CONFESSIONS    Animation
4        ANALYZE HOOSIERS       Horror
..                    ...          ...
181             WAKE JAWS          New
182             WON DARES        Music
183  WONDERLAND CHRISTMAS       Sci-Fi
184   WORKING MICROCOSMOS       Travel
185    WORLD LEATHERNECKS       Horror

[186 rows x 2 columns]

In [47]:
query_chal4 = """
                SELECT f.title, a.first_name ||"_"|| a.last_name AS actor_full_name
                FROM film AS f
                JOIN film_actor AS fa ON f.film_id = fa.film_id
                JOIN actor AS a ON fa.actor_id = a.actor_id
                WHERE f.title LIKE '_Y%'
              """

# Execute the query using pd.read_sql.
df_chal4 = pd.read_sql(query_chal4, conn)

print("Challenge 4")
print(df_chal4)

Challenge 4
               title    actor_full_name
0      WYOMING STORM    BETTE_NICHOLSON
1   TYCOON GATHERING      VIVIEN_BERGEN
2        HYDE DOCTOR       CUBA_OLIVIER
3     CYCLONE FAMILY       HELEN_VOIGHT
4    DYNAMITE TARZAN        BOB_FAWCETT
5        HYDE DOCTOR      LUCILLE_TRACY
6     CYCLONE FAMILY       RIP_CRAWFORD
7      WYOMING STORM      WOODY_HOFFMAN
8     CYCLONE FAMILY          JUDY_DEAN
9       EYES DRIVING         DAN_HARRIS
10       HYDE DOCTOR       JAYNE_NEESON
11       HYDE DOCTOR         BURT_POSEY
12  HYSTERICAL GRAIL         BURT_POSEY
13       DYING MAKER    GROUCHO_SINATRA
14     MYSTIC TRUMAN     SCARLETT_DAMON
15  HYSTERICAL GRAIL   MINNIE_ZELLWEGER
16   DYNAMITE TARZAN     CHARLIZE_DENCH
17  HYSTERICAL GRAIL     CHARLIZE_DENCH
18       HYDE DOCTOR      ELLEN_PRESLEY
19  HYSTERICAL GRAIL          MEG_HAWKE
20  TYCOON GATHERING       SPENCER_DEPP
21  HYSTERICAL GRAIL        WALTER_TORN
22     WYOMING STORM       SIDNEY_CROWE
23       HYDE DOCTOR     GINA_DEGENERES
24  TYCOON GATHERING  CAMERON_ZELLWEGER
25     WYOMING STORM      HARRISON_BALE
26      EYES DRIVING        RENEE_TRACY
27     WYOMING STORM    PENELOPE_MONROE
28   DYNAMITE TARZAN     JULIANNE_DENCH
29  HYSTERICAL GRAIL     JULIANNE_DENCH
30     MYSTIC TRUMAN      KEVIN_GARLAND
31  HYSTERICAL GRAIL    MORGAN_WILLIAMS
32  HYSTERICAL GRAIL        LUCILLE_DEE
33   DYNAMITE TARZAN       EWAN_GOODING
34     MYSTIC TRUMAN         RIVER_DEAN
35      EYES DRIVING        FAY_WINSLET
36  HYSTERICAL GRAIL        JAYNE_NOLTE
37  TYCOON GATHERING      MINNIE_KILMER
38     MYSTIC TRUMAN    HUMPHREY_WILLIS
39      EYES DRIVING     MICHAEL_BENING
40       DYING MAKER     MICHAEL_BOLGER
41  TYCOON GATHERING     MICHAEL_BOLGER
42     WYOMING STORM    JULIA_ZELLWEGER
43   DYNAMITE TARZAN         CUBA_BIRCH
44      EYES DRIVING  JAYNE_SILVERSTONE
45  TYCOON GATHERING        BELA_WALKEN

In [ ]:
query_chal5 = """
                SELECT c.customer_id,  
                FROM customer AS c
                LEFT JOIN rental as r ON p.rental_id = r.rental_id

              """

# Execute the query using pd.read_sql.
df_chal5 = pd.read_sql(query_chal5, conn)

print("Challenge 5")
print(df_chal5)

Challenge 5
       payment_id  customer_id  staff_id  rental_id  amount  \
0               1            1         1       76.0    2.99
1               2            1         1      573.0    0.99
2               3            1         1     1185.0    5.99
3               4            1         2     1422.0    0.99
4               5            1         2     1476.0    9.99
...           ...          ...       ...        ...     ...
16044       16045          599         1    14599.0    4.99
16045       16046          599         1    14719.0    1.99
16046       16047          599         2    15590.0    8.99
16047       16048          599         2    15719.0    2.99
16048       16049          599         2    15725.0    2.99

                  payment_date          last_update  rental_id  \
0      2005-05-25 11:30:37.000  2021-03-06 15:55:57       76.0
1      2005-05-28 10:35:23.000  2021-03-06 15:55:57      573.0
2      2005-06-15 00:54:12.000  2021-03-06 15:55:57     1185.0
3      2005-06-15 18:02:53.000  2021-03-06 15:55:57     1422.0
4      2005-06-15 21:08:46.000  2021-03-06 15:55:57     1476.0
...                        ...                  ...        ...
16044  2005-08-21 17:43:42.000  2021-03-06 15:58:08    14599.0
16045  2005-08-21 21:41:57.000  2021-03-06 15:58:08    14719.0
16046  2005-08-23 06:09:44.000  2021-03-06 15:58:09    15590.0
16047  2005-08-23 11:08:46.000  2021-03-06 15:58:09    15719.0
16048  2005-08-23 11:25:00.000  2021-03-06 15:58:09    15725.0

                   rental_date  inventory_id  customer_id  \
0      2005-05-25 11:30:37.000        3021.0          1.0
1      2005-05-28 10:35:23.000        4020.0          1.0
2      2005-06-15 00:54:12.000        2785.0          1.0
3      2005-06-15 18:02:53.000        1021.0          1.0
4      2005-06-15 21:08:46.000        1407.0          1.0
...                        ...           ...          ...
16044  2005-08-21 17:43:42.000        4575.0        599.0
16045  2005-08-21 21:41:57.000        4091.0        599.0
16046  2005-08-23 06:09:44.000        4048.0        599.0
16047  2005-08-23 11:08:46.000        3990.0        599.0
16048  2005-08-23 11:25:00.000         378.0        599.0

                   return_date  staff_id          last_update
0      2005-06-03 12:00:37.000       2.0  2021-03-06 15:53:41
1      2005-06-03 06:32:23.000       1.0  2021-03-06 15:53:45
2      2005-06-23 02:42:12.000       2.0  2021-03-06 15:53:50
3      2005-06-19 15:54:53.000       2.0  2021-03-06 15:53:52
4      2005-06-25 02:26:46.000       1.0  2021-03-06 15:53:52
...                        ...       ...                  ...
16044  2005-08-22 18:53:42.000       1.0  2021-03-06 15:55:43
16045  2005-08-25 20:37:57.000       1.0  2021-03-06 15:55:44
16046  2005-09-01 06:53:44.000       2.0  2021-03-06 15:55:52
16047  2005-08-25 07:25:46.000       1.0  2021-03-06 15:55:54
16048  2005-08-26 11:46:00.000       1.0  2021-03-06 15:55:54

[16049 rows x 14 columns]

In [ ]:
query_chal6 = """
        
              """

# Execute the query using pd.read_sql.
df_chal6 = pd.read_sql(query_chal6, conn)

print("Challenge 6")
print(df_chal6)

## Close the connection to the database.
Always close the connection when you're done to free up resources.

In [14]:
# Close the connection
conn.close()